OpenNuvoton/M55M1BSP/Library/StdDriver/src/sdh.c
/**************************************************************************//**
 * @file     sdh.c
 * @version  V1.00
 * @brief    SDH driver source file
 *
 * SPDX-License-Identifier: Apache-2.0
 * @copyright (C) 2023 Nuvoton Technology Corp. All rights reserved.
*****************************************************************************/
#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#include "NuMicro.h"

/** @addtogroup Standard_Driver Standard Driver
  @{
*/

/** @addtogroup SDH_Driver SDH Driver
  @{
*/

/** @addtogroup SDH_EXPORTED_FUNCTIONS SDH Exported Functions
  @{
*/

/** @cond HIDDEN_SYMBOLS */

/* global variables */
/* For response R3 (such as ACMD41, CRC-7 is invalid; but SD controller will still */
/* calculate CRC-7 and get an error result, software should ignore this error and clear SDISR [CRC_IF] flag */
/* _sd_uR3_CMD is the flag for it. 1 means software should ignore CRC-7 error */
#if (NVT_DCACHE_ON == 1)
#ifndef __SCB_DCACHE_LINE_SIZE
    #define __SCB_DCACHE_LINE_SIZE    (32UL)
#endif

/* Declare the SDH dedicated DMA buffer as non-cacheable. */
/* Note: Ensure that NVT_DCACHE_ON is enabled and the ARM MPU is initialized for the non-cacheable region in your project. */
NVT_NONCACHEABLE static uint8_t _SDH0_ucSDHCBuffer[SDH_BLOCK_SIZE] __attribute__((aligned(4)))  = {0} ;
NVT_NONCACHEABLE static uint8_t _SDH1_ucSDHCBuffer[SDH_BLOCK_SIZE] __attribute__((aligned(4)))  = {0} ;
#ifndef DEF_ALIGNED_VALUE
    #define DEF_ALIGNED_VALUE         (DCACHE_LINE_SIZE)
#endif

#else

static uint8_t _SDH0_ucSDHCBuffer[SDH_BLOCK_SIZE] __attribute__((aligned(4)))  = {0} ;
static uint8_t _SDH1_ucSDHCBuffer[SDH_BLOCK_SIZE] __attribute__((aligned(4)))  = {0} ;
#ifndef DEF_ALIGNED_VALUE
    #define DEF_ALIGNED_VALUE      4
#endif

#endif
SDH_INFO_T SD0;
SDH_INFO_T SD1;

/* Preserve the legacy reserved high nibble together with the documented writable fields. */
#define SDH_CTL_WRITE_KEEP_MASK    (0xF0000000U | SDH_CTL_SDNWR_Msk | SDH_CTL_DBW_Msk | SDH_CTL_CLKKEEP_Msk)

static uint32_t SDH_GetDMAAddress(const void *pvBuf)
{
    uintptr_t uAddr = (uintptr_t)pvBuf;

    return (uint32_t)uAddr;
}

static uint32_t SDH_IsValidInstance(const SDH_T *sdh)
{
    return (((sdh == SDH0) || (sdh == SDH1)) ? 1U : 0U);
}

static void SDH_InvalidateCardState(SDH_INFO_T *pSD)
{
    uint8_t *pu8DMABuf;

    if (pSD == (SDH_INFO_T *)NULL)
    {
        return;
    }

    pu8DMABuf = pSD->dmabuf;

    (void)memset(pSD, 0, sizeof(SDH_INFO_T));
    pSD->dmabuf = pu8DMABuf;
    pSD->CardType = SDH_TYPE_UNKNOWN;
}

static uint32_t SDH_EnsureCardReady(SDH_T *sdh)
{
    const SDH_INFO_T *pSD;

    pSD = SDH_GetSDInfoMsg(sdh);

    if (pSD == (SDH_INFO_T *)NULL)
    {
        return SDH_SELECT_ERROR;
    }

    if (SDH_CardDetection(sdh) == FALSE)
    {
        return SDH_NO_SD_CARD;
    }

    if ((pSD->CardType == SDH_TYPE_UNKNOWN) || (pSD->RCA == 0U))
    {
        return SDH_Probe(sdh);
    }

    return Successful;
}

static void SDH_UpdateDataReadyFlag(SDH_T *sdh, SDH_INFO_T *pSD)
{

    if (sdh == (SDH_T *)NULL)
    {
        return;
    }

    if (pSD == (SDH_INFO_T *)NULL)
    {
        return;
    }

    if ((sdh->INTSTS & SDH_INTSTS_BLKDIF_Msk) != 0U)
    {
        sdh->INTSTS = SDH_INTSTS_BLKDIF_Msk;
        pSD->DataReadyFlag = (uint8_t)TRUE;
    }
}

#if (NVT_DCACHE_ON == 1)
static void SDH_InvalidateDCacheBuffer(const void *pvBuf, uint32_t u32Size)
{
    uintptr_t u32StartAddr = (uintptr_t)pvBuf;
    uintptr_t u32AlignedStart;
    uintptr_t u32AlignedEnd;
    int32_t u32CacheSize;

    if (u32Size == 0U)
    {
        return;
    }

    u32AlignedStart = u32StartAddr & ~((uintptr_t)DCACHE_LINE_SIZE - 1U);
    u32AlignedEnd = (u32StartAddr + (uintptr_t)u32Size + (uintptr_t)DCACHE_LINE_SIZE - 1U) &
                    ~((uintptr_t)DCACHE_LINE_SIZE - 1U);
    u32CacheSize = (int32_t)u32AlignedEnd - (int32_t)u32AlignedStart;

    SCB_InvalidateDCache_by_Addr((void *)u32AlignedStart, u32CacheSize);
}

static void SDH_CleanDCacheBuffer(const void *pvBuf, uint32_t u32Size)
{
    uintptr_t u32StartAddr = (uintptr_t)pvBuf;
    uintptr_t u32AlignedStart;
    uintptr_t u32AlignedEnd;
    int32_t i32CacheSize;

    if (u32Size == 0U)
    {
        return;
    }

    u32AlignedStart = u32StartAddr & ~((uintptr_t)DCACHE_LINE_SIZE - 1U);
    u32AlignedEnd = (u32StartAddr + (uintptr_t)u32Size + (uintptr_t)DCACHE_LINE_SIZE - 1U) &
                    ~((uintptr_t)DCACHE_LINE_SIZE - 1U);
    i32CacheSize = (int32_t)u32AlignedEnd - (int32_t)u32AlignedStart;

    SCB_CleanDCache_by_Addr((void *)u32AlignedStart, i32CacheSize);
}
#endif

//------------------------------------------------------------------------------
void *SDH_GetSDH0Buffer(void)
{
    return &_SDH0_ucSDHCBuffer[0];
}

void *SDH_GetSDH1Buffer(void)
{
    return &_SDH1_ucSDHCBuffer[0];
}

SDH_INFO_T *SDH_GetSDInfoMsg(const SDH_T *sdh)
{
    if (sdh == SDH0)
    {
        return &SD0;
    }
    else if (sdh == SDH1)
    {
        return &SD1;
    }
    else
    {
    }

    return NULL;
}

int32_t SDH_CheckRB(SDH_T *sdh)
{
    int32_t i32TimeOutCount2;
    uint32_t u32Done = 0U;
    SDH_INFO_T *pSD;

    pSD = SDH_GetSDInfoMsg(sdh);

    if (pSD == (SDH_INFO_T *)NULL)
    {
        return Fail;
    }

    pSD->i32ErrCode = 0;

    i32TimeOutCount2 = (int32_t)SDH_TIMEOUT_CNT;

    while (u32Done == 0U)
    {
        int32_t i32TimeOutCount1 = (int32_t)SDH_TIMEOUT_CNT;
        sdh->CTL |= SDH_CTL_CLK8OEN_Msk;

        while ((sdh->CTL & SDH_CTL_CLK8OEN_Msk) == SDH_CTL_CLK8OEN_Msk)
        {
            if (--i32TimeOutCount1 == 0)
            {
                pSD->i32ErrCode = SDH_ERR_TIMEOUT;
                break;
            }
        }

        if ((sdh->INTSTS & SDH_INTSTS_DAT0STS_Msk) == SDH_INTSTS_DAT0STS_Msk)
        {
            u32Done = 1;
        }
        else
        {
            if (--i32TimeOutCount2 == 0)
            {
                pSD->i32ErrCode = SDH_ERR_TIMEOUT;
                u32Done = 1;
            }
        }
    }

    if (pSD->i32ErrCode != 0)
    {
        return Fail;
    }

    return Successful;
}

uint32_t SDH_SDCommand(SDH_T *sdh, uint32_t u32Cmd, uint32_t u32Arg)
{
    volatile uint32_t u32Buf;
    volatile uint32_t u32Val = 0U;
    SDH_INFO_T *pSD;
    int32_t i32TimeOutCount = (int32_t)SDH_TIMEOUT_CNT;

    pSD = SDH_GetSDInfoMsg(sdh);

    if (pSD == (SDH_INFO_T *)NULL)
    {
        return SDH_SELECT_ERROR;
    }

    pSD->i32ErrCode = 0;

