OpenNuvoton/M55M1BSP/Library/StdDriver/src/sdh.c
    sdh->CMDARG = u32Arg;
    u32Buf = (sdh->CTL & (~SDH_CTL_CMDCODE_Msk)) | (u32Cmd << 8U) | (SDH_CTL_COEN_Msk);
    sdh->CTL = u32Buf;

    while ((sdh->CTL & SDH_CTL_COEN_Msk) == SDH_CTL_COEN_Msk)
    {
        if (pSD->IsCardInsert == 0U)
        {
            u32Val = SDH_NO_SD_CARD;
        }

        if (--i32TimeOutCount <= 0)
        {
            pSD->i32ErrCode = SDH_ERR_TIMEOUT;
            break;
        }
    }

    if (pSD->i32ErrCode != 0)
    {
        return Fail;
    }

    return u32Val;
}

uint32_t SDH_SDCmdAndRsp(SDH_T *sdh, uint32_t u32Cmd, uint32_t u32Arg, uint32_t u32NtickCount)
{
    volatile uint32_t u32Buf;
    SDH_INFO_T *pSD;
    int32_t i32TimeOutCount = (int32_t)SDH_TIMEOUT_CNT;

    pSD = SDH_GetSDInfoMsg(sdh);

    if (pSD == (SDH_INFO_T *)NULL)
    {
        return SDH_SELECT_ERROR;
    }

    pSD->i32ErrCode = 0;

    sdh->CMDARG = u32Arg;
    u32Buf = (sdh->CTL & (~SDH_CTL_CMDCODE_Msk)) | (u32Cmd << 8U) | (SDH_CTL_COEN_Msk | SDH_CTL_RIEN_Msk);
    sdh->CTL = u32Buf;

    if (u32NtickCount > 0U)
    {
        uint32_t u32NtickCountTmp = u32NtickCount;

        while ((sdh->CTL & SDH_CTL_RIEN_Msk) == SDH_CTL_RIEN_Msk)
        {
            u32NtickCountTmp--;

            if (u32NtickCountTmp == 0U)
            {
                sdh->CTL |= SDH_CTL_CTLRST_Msk; /* reset SD engine */
                return 2U;
            }

            if (pSD->IsCardInsert == FALSE)
            {
                return SDH_NO_SD_CARD;
            }
        }
    }
    else
    {
        while ((sdh->CTL & SDH_CTL_RIEN_Msk) == SDH_CTL_RIEN_Msk)
        {
            if (pSD->IsCardInsert == FALSE)
            {
                return SDH_NO_SD_CARD;
            }

            if (--i32TimeOutCount <= 0)
            {
                pSD->i32ErrCode = SDH_ERR_TIMEOUT;
                break;
            }
        }
    }

    if (pSD->i32ErrCode != 0)
    {
        return Fail;
    }

    if (pSD->R7Flag)
    {
        uint32_t tmp0 = 0U;
        uint32_t tmp1 = 0U;
        tmp1 = sdh->RESP1 & 0xffU;
        tmp0 = sdh->RESP0 & 0xfU;

        if ((tmp1 != 0x55U) && (tmp0 != 0x01U))
        {
            pSD->R7Flag = 0U;
            return SDH_CMD8_ERROR;
        }
    }

    if (!pSD->R3Flag)
    {
        if ((sdh->INTSTS & SDH_INTSTS_CRC7_Msk) == SDH_INTSTS_CRC7_Msk)     /* check CRC7 */
        {
            return Successful;
        }
        else
        {
            return SDH_CRC7_ERROR;
        }
    }
    else
    {
        /* ignore CRC error for R3 case */
        pSD->R3Flag = 0U;
        sdh->INTSTS = SDH_INTSTS_CRCIF_Msk;
        return Successful;
    }
}

static uint32_t SDH_Swap32(uint32_t u32Val)
{
    uint32_t u32B0 = (u32Val & 0x000000FFU) << 24;
    uint32_t u32B1 = (u32Val & 0x0000FF00U) << 8;
    uint32_t u32B2 = (u32Val & 0x00FF0000U) >> 8;
    uint32_t u32B3 = (u32Val & 0xFF000000U) >> 24;

    return (u32B0 | u32B1 | u32B2 | u32B3);
}

/* Get 16 bytes CID or CSD */
uint32_t SDH_SDCmdAndRsp2(SDH_T *sdh, uint32_t u32Cmd, uint32_t u32Arg, uint32_t pu32R2ptr[])
{
    uint32_t u32Buf;
    SDH_INFO_T *pSD;
    int32_t i32TimeOutCount = (int32_t)SDH_TIMEOUT_CNT;

    if (pu32R2ptr == (uint32_t *)NULL)
    {
        return Fail;
    }

    pSD = SDH_GetSDInfoMsg(sdh);

    if (pSD == (SDH_INFO_T *)NULL)
    {
        return SDH_SELECT_ERROR;
    }

    pSD->i32ErrCode = 0;

    sdh->CMDARG = u32Arg;
    u32Buf = (sdh->CTL & (~SDH_CTL_CMDCODE_Msk)) |
             (u32Cmd << 8) | (SDH_CTL_COEN_Msk | SDH_CTL_R2EN_Msk);
    sdh->CTL = u32Buf;

    while ((sdh->CTL & SDH_CTL_R2EN_Msk) == SDH_CTL_R2EN_Msk)
    {
        if (pSD->IsCardInsert == FALSE)
        {
            return SDH_NO_SD_CARD;
        }

        if (--i32TimeOutCount <= 0)
        {
            pSD->i32ErrCode = SDH_ERR_TIMEOUT;
            break;
        }
    }

    if ((sdh->INTSTS & SDH_INTSTS_CRC7_Msk) == SDH_INTSTS_CRC7_Msk)
    {
        uint32_t u32i;
        uint32_t tmpBuf[5];

        for (u32i = 0U; u32i < 5U; u32i++)
        {
            tmpBuf[u32i] = SDH_Swap32(sdh->FB[u32i]);
        }

        for (u32i = 0U; u32i < 4U; u32i++)
        {
            pu32R2ptr[u32i] = ((tmpBuf[u32i] & 0x00ffffffU) << 8U) |
                              ((tmpBuf[u32i + 1U] & 0xff000000U) >> 24U);
        }
    }
    else
    {
        return SDH_CRC7_ERROR;
    }

    if (pSD->i32ErrCode != 0)
    {
        return Fail;
    }

    return Successful;
}


static uint32_t SDH_SDCmdAndRspDataIn(SDH_T *sdh, uint32_t u32Cmd, uint32_t u32Arg)
{
    volatile uint32_t u32Buf;
    SDH_INFO_T *pSD;
    int32_t i32TimeOutCount;

    if (sdh == SDH0)
    {
        pSD = &SD0;
    }
    else
    {
        pSD = &SD1;
    }

    pSD->i32ErrCode = 0;

    sdh->CMDARG = u32Arg;
    u32Buf = (sdh->CTL & (~SDH_CTL_CMDCODE_Msk)) | (u32Cmd << 8U) |
             (SDH_CTL_COEN_Msk | SDH_CTL_RIEN_Msk | SDH_CTL_DIEN_Msk);

    sdh->CTL = u32Buf;

    i32TimeOutCount = (int32_t)SDH_TIMEOUT_CNT;

    while ((sdh->CTL & SDH_CTL_RIEN_Msk) == SDH_CTL_RIEN_Msk)
    {
        if (pSD->IsCardInsert == FALSE)
        {
            return SDH_NO_SD_CARD;
        }

        if (--i32TimeOutCount <= 0)
        {
            pSD->i32ErrCode = SDH_ERR_TIMEOUT;
            break;
        }
    }

    i32TimeOutCount = (int32_t)SDH_TIMEOUT_CNT;

    while ((sdh->CTL & SDH_CTL_DIEN_Msk) == SDH_CTL_DIEN_Msk)
    {
        if (pSD->IsCardInsert == FALSE)
        {
            return SDH_NO_SD_CARD;
        }

        if (--i32TimeOutCount <= 0)
        {
            pSD->i32ErrCode = SDH_ERR_TIMEOUT;
            break;
        }
    }

    if ((sdh->INTSTS & SDH_INTSTS_CRC7_Msk) != SDH_INTSTS_CRC7_Msk)
    {
        /* check CRC7 */
        return SDH_CRC7_ERROR;
    }

    if ((sdh->INTSTS & SDH_INTSTS_CRC16_Msk) != SDH_INTSTS_CRC16_Msk)
    {
        /* check CRC16 */
        return SDH_CRC16_ERROR;
    }

    return 0U;
}

/* there are 8 bits for divider0, maximum is 256 */
#define SDH_CLK_DIV0_MAX     256U

void SDH_Set_clock(const SDH_T *sdh, uint32_t u32SD_clk_khz)
{
    static uint32_t s_u32SDH0ClkSrc;
    static uint32_t s_u32SDH1ClkSrc;
    static uint32_t _SDH0_ReferenceClock;
    static uint32_t _SDH1_ReferenceClock;
    uint32_t u32Rate;
    uint32_t u32Div1;
    uint32_t u32SD_Clk_khzTemp = u32SD_clk_khz;
    uint32_t u32RegLockLevel = SYS_IsRegLocked();

    if (SDH_IsValidInstance(sdh) == 0U)
    {
        return;
    }

    if (u32RegLockLevel)
    {
        SYS_UnlockReg();
    }

    /* initial state, clock source use HIRC */
    if (u32SD_Clk_khzTemp <= 400U)
    {
        static uint32_t u32SD_PwrCtl = 0U;

        u32SD_PwrCtl = CLK->SRCCTL;

