OpenNuvoton/M55M1BSP/Library/StdDriver/src/sdh.c
        if ((u32SD_PwrCtl & CLK_SRCCTL_HIRCEN_Msk) != 0x4U)
        {
            CLK->SRCCTL |= CLK_SRCCTL_HIRCEN_Msk;
        }

        if (sdh == SDH0)
        {
            s_u32SDH0ClkSrc = (CLK->SDHSEL & CLK_SDHSEL_SDH0SEL_Msk);
            CLK->SDHSEL = (CLK->SDHSEL & ~CLK_SDHSEL_SDH0SEL_Msk) |
                          CLK_SDHSEL_SDH0SEL_HIRC;
            _SDH0_ReferenceClock = (__HIRC / 1000U);
        }
        else
        {
            s_u32SDH1ClkSrc = (CLK->SDHSEL & CLK_SDHSEL_SDH1SEL_Msk);
            CLK->SDHSEL = (CLK->SDHSEL & ~CLK_SDHSEL_SDH1SEL_Msk) |
                          CLK_SDHSEL_SDH1SEL_HIRC;
            _SDH1_ReferenceClock = (__HIRC / 1000U);
        }
    }
    /* transfer state, clock source use sys_init() */
    else
    {
        //CLK->SRCCTL = u32SD_PwrCtl;

        if (sdh == SDH0)
        {
            CLK->SDHSEL = (CLK->SDHSEL & ~CLK_SDHSEL_SDH0SEL_Msk) | s_u32SDH0ClkSrc;

            switch (s_u32SDH0ClkSrc)
            {
                case CLK_SDHSEL_SDH0SEL_APLL1_DIV2:
                    _SDH0_ReferenceClock = ((CLK_GetAPLL1ClockFreq() >> 1U) / 1000U);
                    break;

                case CLK_SDHSEL_SDH0SEL_HCLK0:
                    _SDH0_ReferenceClock = (CLK_GetHCLK0Freq() / 1000U);
                    break;

                case CLK_SDHSEL_SDH0SEL_HIRC:
                    _SDH0_ReferenceClock = (__HIRC / 1000U);
                    break;

                case CLK_SDHSEL_SDH0SEL_HIRC48M_DIV4:
                    _SDH0_ReferenceClock = ((__HIRC48M / 1000U) / 4U);
                    break;

                case CLK_SDHSEL_SDH0SEL_HXT:
                default:
                    _SDH0_ReferenceClock = (CLK_GetHXTFreq() / 1000U);
                    break;
            }
        }
        else
        {
            CLK->SDHSEL = (CLK->SDHSEL & ~CLK_SDHSEL_SDH1SEL_Msk) | s_u32SDH1ClkSrc;

            switch (s_u32SDH1ClkSrc)
            {
                case CLK_SDHSEL_SDH1SEL_APLL1_DIV2:
                    _SDH1_ReferenceClock = ((CLK_GetAPLL1ClockFreq() >> 1U) / 1000U);
                    break;

                case CLK_SDHSEL_SDH1SEL_HCLK0:
                    _SDH1_ReferenceClock = (CLK_GetHCLK0Freq() / 1000U);
                    break;

                case CLK_SDHSEL_SDH1SEL_HIRC:
                    _SDH1_ReferenceClock = (__HIRC / 1000U);
                    break;

                case CLK_SDHSEL_SDH1SEL_HIRC48M_DIV4:
                    _SDH1_ReferenceClock = ((__HIRC48M / 1000U) / 4U);
                    break;

                case CLK_SDHSEL_SDH1SEL_HXT:
                default:
                    _SDH1_ReferenceClock = (CLK_GetHXTFreq() / 1000U);
                    break;
            }
        }

        if (u32SD_Clk_khzTemp >= 50000U)
        {
            u32SD_Clk_khzTemp = 50000U;
        }
    }

    if (sdh == SDH0)
    {
        u32Rate = _SDH0_ReferenceClock / u32SD_Clk_khzTemp;

        /* choose slower clock if system clock cannot divisible by wanted clock */
        if ((_SDH0_ReferenceClock % u32SD_Clk_khzTemp) != 0U)
        {
            u32Rate++;
        }
    }
    else
    {
        u32Rate = _SDH1_ReferenceClock / u32SD_Clk_khzTemp;

        /* choose slower clock if system clock cannot divisible by wanted clock */
        if ((_SDH1_ReferenceClock % u32SD_Clk_khzTemp) != 0U)
        {
            u32Rate++;
        }
    }

    if (u32Rate >= SDH_CLK_DIV0_MAX)
    {
        u32Rate = SDH_CLK_DIV0_MAX;
    }

    /*--- calculate the second divider CLKDIV0[SDHOST_N]*/
    u32Div1 = (u32Rate - 1U) & 0xFFU;

    /*--- setup register */
    if (sdh == SDH0)
    {
        CLK->SDHDIV &= ~CLK_SDHDIV_SDH0DIV_Msk;
        CLK->SDHDIV |= (u32Div1 << CLK_SDHDIV_SDH0DIV_Pos);
    }
    else
    {
        CLK->SDHDIV &= ~CLK_SDHDIV_SDH1DIV_Msk;
        CLK->SDHDIV |= (u32Div1 << CLK_SDHDIV_SDH1DIV_Pos);
    }

    if (u32RegLockLevel)
    {
        SYS_LockReg();
    }

    return;
}

uint32_t SDH_CardDetection(SDH_T *sdh)
{
    uint32_t u32Val = TRUE;
    SDH_INFO_T *pSD;

    pSD = SDH_GetSDInfoMsg(sdh);

    if (pSD == (SDH_INFO_T *)NULL)
    {
        return FALSE;
    }

    if ((sdh->INTEN & SDH_INTEN_CDSRC_Msk) == SDH_INTEN_CDSRC_Msk)   /* Card detect pin from GPIO */
    {
        sdh->CTL &= ~SDH_CTL_CLKKEEP_Msk;

        if ((sdh->INTSTS & SDH_INTSTS_CDSTS_Msk) == SDH_INTSTS_CDSTS_Msk)   /* Card remove */
        {
            SDH_InvalidateCardState(pSD);
            pSD->IsCardInsert = (uint8_t)FALSE;
            u32Val = FALSE;
        }
        else
        {
            pSD->IsCardInsert = (uint8_t)TRUE;
        }
    }
    else if ((sdh->INTEN & SDH_INTEN_CDSRC_Msk) != SDH_INTEN_CDSRC_Msk)
    {
        volatile uint32_t u32i;
        sdh->CTL |= SDH_CTL_CLKKEEP_Msk;

        for (u32i = 0U; u32i < 5000U; u32i++)
        {
        }

        if ((sdh->INTSTS & SDH_INTSTS_CDSTS_Msk) == SDH_INTSTS_CDSTS_Msk)   /* Card insert */
        {
            pSD->IsCardInsert = (uint8_t)TRUE;
        }
        else
        {
            SDH_InvalidateCardState(pSD);
            pSD->IsCardInsert = (uint8_t)FALSE;
            u32Val = FALSE;
        }

        sdh->CTL &= ~SDH_CTL_CLKKEEP_Msk;
    }
    else
    {

    }

    return u32Val;
}

static uint32_t SDH_Init(SDH_T *sdh)
{
    volatile uint32_t u32i = 0;
    uint32_t u32Resp;
    uint32_t volatile u32CmdTimeOut;
    SDH_INFO_T *pSD;
    int32_t i32TimeOutCount;

    if (sdh == SDH0)
    {
        pSD = &SD0;
    }
    else
    {
        pSD = &SD1;
    }

    pSD->i32ErrCode = 0;

    /* set the clock to 300KHz */
    SDH_Set_clock(sdh, 300U);

    /* power ON 74 clock */
    sdh->CTL |= SDH_CTL_CLK74OEN_Msk;

    i32TimeOutCount = (int32_t)SDH_TIMEOUT_CNT;

    while ((sdh->CTL & SDH_CTL_CLK74OEN_Msk) == SDH_CTL_CLK74OEN_Msk)
    {
        if (pSD->IsCardInsert == FALSE)
        {
            return SDH_NO_SD_CARD;
        }

        if (--i32TimeOutCount <= 0)
        {
            pSD->i32ErrCode = SDH_ERR_TIMEOUT;
            break;
        }
    }

    (void)SDH_SDCommand(sdh, 0U, 0U);        /* reset all cards */

    for (u32i = 0; u32i < 0x1000U; u32i++) {}

