OpenNuvoton/M55M1BSP/Library/StdDriver/src/sdh.c
    /* initial SDHC */
    pSD->R7Flag = 1U;
    u32CmdTimeOut = 0xFFFFFU;

    u32i = SDH_SDCmdAndRsp(sdh, 8U, 0x00000155U, u32CmdTimeOut);

    if (u32i == Successful)
    {
        /* SD 2.0 */
        (void)SDH_SDCmdAndRsp(sdh, 55U, 0x00U, u32CmdTimeOut);
        pSD->R3Flag = 1U;
        (void)SDH_SDCmdAndRsp(sdh, 41U, 0x40ff8000U, u32CmdTimeOut); /* 2.7v-3.6v */
        u32Resp = sdh->RESP0;

        i32TimeOutCount = (int32_t)SDH_TIMEOUT_CNT;

        while ((u32Resp & 0x00800000U) != 0x00800000U)        /* check if card is ready */
        {
            (void)SDH_SDCmdAndRsp(sdh, 55U, 0x00U, u32CmdTimeOut);
            pSD->R3Flag = 1U;
            (void)SDH_SDCmdAndRsp(sdh, 41U, 0x40ff8000U, u32CmdTimeOut); /* 3.0v-3.4v */
            u32Resp = sdh->RESP0;

            if (--i32TimeOutCount <= 0)
            {
                pSD->i32ErrCode = SDH_ERR_TIMEOUT;
                break;
            }
        }

        if ((u32Resp & 0x00400000U) == 0x00400000U)
        {
            pSD->CardType = SDH_TYPE_SD_HIGH;
        }
        else
        {
            pSD->CardType = SDH_TYPE_SD_LOW;
        }
    }
    else
    {
        /* SD 1.1 */
        (void)SDH_SDCommand(sdh, 0U, 0U);        /* reset all cards */

        for (u32i = 0; u32i < 0x100U; u32i++)
        {
        }

        u32i = SDH_SDCmdAndRsp(sdh, 55U, 0x00U, u32CmdTimeOut);

        if (u32i == 2U)     /* MMC memory */
        {
            (void)SDH_SDCommand(sdh, 0U, 0U);        /* reset */

            for (u32i = 0; u32i < 0x100U; u32i++)
            {
            }

            pSD->R3Flag = 1U;

            if (SDH_SDCmdAndRsp(sdh, 1U, 0x40ff8000U, u32CmdTimeOut) != 2U)    /* eMMC memory */
            {
                u32Resp = sdh->RESP0;
                i32TimeOutCount = (int32_t)SDH_TIMEOUT_CNT;

                while ((u32Resp & 0x00800000U) != 0x00800000U)
                {
                    /* check if card is ready */
                    pSD->R3Flag = 1U;

                    (void)SDH_SDCmdAndRsp(sdh, 1U, 0x40ff8000U, u32CmdTimeOut);      /* high voltage */
                    u32Resp = sdh->RESP0;

                    if (--i32TimeOutCount <= 0)
                    {
                        pSD->i32ErrCode = SDH_ERR_TIMEOUT;
                        break;
                    }
                }

                if ((u32Resp & 0x00400000U) == 0x00400000U)
                {
                    pSD->CardType = SDH_TYPE_EMMC;
                }
                else
                {
                    pSD->CardType = SDH_TYPE_MMC;
                }
            }
            else
            {
                pSD->CardType = SDH_TYPE_UNKNOWN;
                return SDH_ERR_DEVICE;
            }
        }
        else if (u32i == 0U)     /* SD Memory */
        {
            pSD->R3Flag = 1U;
            (void)SDH_SDCmdAndRsp(sdh, 41U, 0x00ff8000U, u32CmdTimeOut); /* 3.0v-3.4v */
            u32Resp = sdh->RESP0;
            i32TimeOutCount = (int32_t)SDH_TIMEOUT_CNT;

            while ((u32Resp & 0x00800000U) != 0x00800000U)        /* check if card is ready */
            {
                (void)SDH_SDCmdAndRsp(sdh, 55U, 0x00U, u32CmdTimeOut);
                pSD->R3Flag = 1U;
                (void)SDH_SDCmdAndRsp(sdh, 41U, 0x00ff8000U, u32CmdTimeOut); /* 3.0v-3.4v */
                u32Resp = sdh->RESP0;

                if (--i32TimeOutCount <= 0)
                {
                    pSD->i32ErrCode = SDH_ERR_TIMEOUT;
                    break;
                }
            }

            pSD->CardType = SDH_TYPE_SD_LOW;
        }
        else
        {
            pSD->CardType = SDH_TYPE_UNKNOWN;
            return SDH_INIT_ERROR;
        }
    }

    if (pSD->CardType != SDH_TYPE_UNKNOWN)
    {
        uint32_t u32Status;
        uint32_t au32CIDBuffer[4];
        (void)SDH_SDCmdAndRsp2(sdh, 2U, 0x00U, au32CIDBuffer);

        if ((pSD->CardType == SDH_TYPE_MMC) ||
                (pSD->CardType == SDH_TYPE_EMMC))
        {
            u32Status = SDH_SDCmdAndRsp(sdh, 3U, 0x10000U, 0U);

            if (u32Status != Successful)     /* set RCA */
            {
                return u32Status;
            }

            pSD->RCA = 0x10000U;
        }
        else
        {
            u32Status = SDH_SDCmdAndRsp(sdh, 3U, 0x00U, 0U);

            if (u32Status != Successful)       /* get RCA */
            {
                return u32Status;
            }
            else
            {
                pSD->RCA = ((sdh->RESP0 << 8U) & 0xffff0000U);
            }
        }
    }

    if (pSD->i32ErrCode != 0)
    {
        return Fail;
    }

    return Successful;
}

uint32_t SDH_SwitchToHighSpeed(SDH_T *sdh, SDH_INFO_T *pSD)
{
    uint32_t volatile u32Status = 0U;
    uint16_t current_comsumption;
    uint16_t busy_status0;
    int32_t i32TimeOutCount = (int32_t)SDH_TIMEOUT_CNT;

    if ((SDH_IsValidInstance(sdh) == 0U) ||
            (pSD == (SDH_INFO_T *)NULL) ||
            (((sdh == SDH0) && (pSD != &SD0)) || ((sdh == SDH1) && (pSD != &SD1))) ||
            (pSD->dmabuf == (uint8_t *)NULL))
    {
        return SDH_SELECT_ERROR;
    }

    pSD->i32ErrCode = 0;

    sdh->DMASA = SDH_GetDMAAddress(pSD->dmabuf);
    sdh->BLEN = 63U;

    u32Status = SDH_SDCmdAndRspDataIn(sdh, 6U, 0x00ffff01U);

    if (u32Status != Successful)
    {
        return Fail;
    }

    current_comsumption = ((uint16_t)(*pSD->dmabuf) << 8U);
    current_comsumption |= (uint16_t)(*(&pSD->dmabuf[1]));

    if (!current_comsumption)
    {
        return Fail;
    }

    busy_status0 = ((uint16_t)(*(&pSD->dmabuf[28])) << 8U);
    busy_status0 |= (uint16_t)(*(&pSD->dmabuf[29]));

    if (!busy_status0)   /* function ready */
    {
        sdh->DMASA = SDH_GetDMAAddress(pSD->dmabuf);
        sdh->BLEN = 63U;    /* 512 bit */

        u32Status = SDH_SDCmdAndRspDataIn(sdh, 6U, 0x80ffff01U);

        if (u32Status != Successful)
        {
            return Fail;
        }

        /* function change timing: 8 clocks */
        sdh->CTL |= SDH_CTL_CLK8OEN_Msk;

        while ((sdh->CTL & SDH_CTL_CLK8OEN_Msk) == SDH_CTL_CLK8OEN_Msk)
        {
            if (--i32TimeOutCount <= 0)
            {
                pSD->i32ErrCode = SDH_ERR_TIMEOUT;
                break;
            }
        }

        if (pSD->i32ErrCode != 0)
        {
            return Fail;
        }

        current_comsumption = (uint16_t)((*pSD->dmabuf) << 8U);
        current_comsumption |= (uint16_t)(*(&pSD->dmabuf[1]));

