OpenNuvoton/M55M1BSP/Library/StdDriver/src/sdh.c
        if (!current_comsumption)
        {
            return Fail;
        }

        return Successful;
    }
    else
    {
        return Fail;
    }
}

uint32_t SDH_SelectCardType(SDH_T *sdh)
{
    uint32_t volatile u32Status = 0U;
    SDH_INFO_T *pSD;
    int32_t i32TimeOutCount;

    pSD = SDH_GetSDInfoMsg(sdh);

    if (pSD == (SDH_INFO_T *)NULL)
    {
        return SDH_SELECT_ERROR;
    }

    pSD->i32ErrCode = 0;

    u32Status = SDH_SDCmdAndRsp(sdh, 7U, pSD->RCA, 0U);

    if (u32Status != Successful)
    {
        return u32Status;
    }

    u32Status = SDH_CheckRB(sdh);

    if (u32Status != Successful)
    {
        return SDH_ERR_TIMEOUT;
    }

    /* if SD card set 4bit */
    if (pSD->CardType == SDH_TYPE_SD_HIGH)
    {
        sdh->DMASA = SDH_GetDMAAddress(pSD->dmabuf);
        sdh->BLEN = 0x07U;  /* 64 bit */
        sdh->DMACTL |= SDH_DMACTL_DMARST_Msk;
        i32TimeOutCount = (int32_t)SDH_TIMEOUT_CNT;

        while ((sdh->DMACTL & SDH_DMACTL_DMARST_Msk) == 0x2U)
        {
            if (--i32TimeOutCount <= 0)
            {
                pSD->i32ErrCode = SDH_ERR_TIMEOUT;
                break;
            }
        }

        u32Status = SDH_SDCmdAndRsp(sdh, 55U, pSD->RCA, 0U);

        if (u32Status != Successful)
        {
            return u32Status;
        }

        u32Status = SDH_SDCmdAndRspDataIn(sdh, 51U, 0x00U);

        if (u32Status != Successful)
        {
            return u32Status;
        }

        if ((*pSD->dmabuf & 0xfU) == 0x2U)
        {
            u32Status = SDH_SwitchToHighSpeed(sdh, pSD);

            if (u32Status == Successful)
            {
                /* divider */
                SDH_Set_clock(sdh, SDHC_FREQ);
            }
        }

        u32Status = SDH_SDCmdAndRsp(sdh, 55U, pSD->RCA, 0U);

        if (u32Status != Successful)
        {
            return u32Status;
        }

        u32Status = SDH_SDCmdAndRsp(sdh, 6U, 0x02U, 0U);

        if (u32Status != Successful)   /* set bus width */
        {
            return u32Status;
        }

        sdh->CTL |= SDH_CTL_DBW_Msk;
    }
    else if (pSD->CardType == SDH_TYPE_SD_LOW)
    {
        sdh->DMASA = SDH_GetDMAAddress(pSD->dmabuf);
        sdh->BLEN = 0x07U;

        u32Status = SDH_SDCmdAndRsp(sdh, 55U, pSD->RCA, 0U);

        if (u32Status != Successful)
        {
            return u32Status;
        }

        u32Status = SDH_SDCmdAndRspDataIn(sdh, 51U, 0x00U);

        if (u32Status != Successful)
        {
            return u32Status;
        }

        /* set data bus width. ACMD6 for SD card, SDCR_DBW for host. */
        u32Status = SDH_SDCmdAndRsp(sdh, 55U, pSD->RCA, 0U);

        if (u32Status != Successful)
        {
            return u32Status;
        }

        u32Status = SDH_SDCmdAndRsp(sdh, 6U, 0x02U, 0U);

        if (u32Status != Successful)
        {
            return u32Status;
        }

        sdh->CTL |= SDH_CTL_DBW_Msk;
    }
    else if ((pSD->CardType == SDH_TYPE_MMC) || (pSD->CardType == SDH_TYPE_EMMC))
    {
        uint32_t u32Param;

        if (pSD->CardType == SDH_TYPE_MMC)
        {
            sdh->CTL &= ~SDH_CTL_DBW_Msk;
        }

        /*--- sent CMD6 to MMC card to set bus width to 4 bits mode */
        /* set CMD6 argument Access field to 3, Index to 183, Value to 1 (4-bit mode) */
        u32Param = ((uint32_t)3U << 24U) | ((uint32_t)183U << 16U) | ((uint32_t)1U << 8U);

        u32Status = SDH_SDCmdAndRsp(sdh, 6U, u32Param, 0U);

        if (u32Status != Successful)
        {
            return u32Status;
        }

        u32Status = SDH_CheckRB(sdh);

        if (u32Status != Successful)
        {
            return SDH_ERR_TIMEOUT;
        }

        sdh->CTL |= SDH_CTL_DBW_Msk; /* set bus width to 4-bit mode for SD host controller */
    }
    else
    {

    }

    u32Status = SDH_SDCmdAndRsp(sdh, 16U, SDH_BLOCK_SIZE, 0U);

    if (u32Status != Successful)
    {
        return u32Status;
    }

    sdh->BLEN = SDH_BLOCK_SIZE - 1U;

    (void)SDH_SDCommand(sdh, 7U, 0U);
    sdh->CTL |= SDH_CTL_CLK8OEN_Msk;
    i32TimeOutCount = (int32_t)SDH_TIMEOUT_CNT;

    while ((sdh->CTL & SDH_CTL_CLK8OEN_Msk) == SDH_CTL_CLK8OEN_Msk)
    {
        if (--i32TimeOutCount <= 0)
        {
            pSD->i32ErrCode = SDH_ERR_TIMEOUT;
            break;
        }
    }

    if (pSD->i32ErrCode != 0)
    {
        return Fail;
    }

    sdh->INTEN |= SDH_INTEN_BLKDIEN_Msk;

    return Successful;
}

void SDH_Get_SD_info(SDH_T *sdh)
{
    uint32_t u32R_LEN;
    uint32_t u32C_Size;
    uint32_t u32MULT;
    uint32_t u32Size;
    uint32_t au32Buffer[4];
    //unsigned char *ptr;
    SDH_INFO_T *pSD;
    int32_t i32TimeOutCount = (int32_t)SDH_TIMEOUT_CNT;

    if (sdh == (SDH_T *)NULL)
    {
        return;
    }

    if (sdh == SDH0)
    {
        pSD = &SD0;
    }
    else
    {
        pSD = &SD1;
    }

    pSD->i32ErrCode = 0;

    (void)SDH_SDCmdAndRsp2(sdh, 9U, pSD->RCA, au32Buffer);

    if ((pSD->CardType == SDH_TYPE_MMC) || (pSD->CardType == SDH_TYPE_EMMC))
    {
        /* for MMC/eMMC card */
        if ((au32Buffer[0] & 0xc0000000U) == 0xc0000000U)
        {
            /* CSD_STRUCTURE [127:126] is 3 */
            /* CSD version depend on EXT_CSD register in eMMC v4.4 for card size > 2GB */
            (void)SDH_SDCmdAndRsp(sdh, 7U, pSD->RCA, 0U);

            //ptr = (uint8_t *)((uint32_t)_SDH_ucSDHCBuffer );
            sdh->DMASA = SDH_GetDMAAddress(pSD->dmabuf);
            sdh->BLEN = 511U;  /* read 512 bytes for EXT_CSD */

            if (SDH_SDCmdAndRspDataIn(sdh, 8U, 0x00U) == Successful)
            {
                (void)SDH_SDCommand(sdh, 7U, 0U);
                sdh->CTL |= SDH_CTL_CLK8OEN_Msk;

                while ((sdh->CTL & SDH_CTL_CLK8OEN_Msk) == SDH_CTL_CLK8OEN_Msk)
                {
                    if (--i32TimeOutCount <= 0)
                    {
                        pSD->i32ErrCode = SDH_ERR_TIMEOUT;
                        break;
                    }
                }

                pSD->totalSectorN = ((uint32_t)(*(&pSD->dmabuf[215])) << 24U);
                pSD->totalSectorN |= ((uint32_t)(*(&pSD->dmabuf[214])) << 16U);
                pSD->totalSectorN |= ((uint32_t)(*(&pSD->dmabuf[213])) << 8U);
                pSD->totalSectorN |= (uint32_t)(*(&pSD->dmabuf[212]));
                pSD->diskSize = (pSD->totalSectorN / 2U);
            }
        }
        else
        {
            /* CSD version v1.0/1.1/1.2 in eMMC v4.4 spec for card size <= 2GB */
            u32R_LEN = ((au32Buffer[1] & 0x000f0000U) >> 16U);
            u32C_Size = (((au32Buffer[1] & 0x000003ffU) << 2U) |
                         ((au32Buffer[2] & 0xc0000000U) >> 30U));
            u32MULT = ((au32Buffer[2] & 0x00038000U) >> 15U);
            u32Size = ((u32C_Size + 1U) * (1U << (u32MULT + 2U)) * (1U << u32R_LEN));

