OpenNuvoton/M55M1BSP/Library/StdDriver/src/sdh.c
            pSD->diskSize = (u32Size / 1024U);
            pSD->totalSectorN = (u32Size / 512U);
        }
    }
    else
    {
        if ((au32Buffer[0] & 0xc0000000U) != 0x0U)
        {
            u32C_Size = (((au32Buffer[1] & 0x0000003fU) << 16U) |
                         ((au32Buffer[2] & 0xffff0000U) >> 16U));
            u32Size = (u32C_Size + 1U) * 512U;  /* Kbytes */

            pSD->diskSize = u32Size;
            pSD->totalSectorN = (u32Size << 1U);
        }
        else
        {
            u32R_LEN = ((au32Buffer[1] & 0x000f0000U) >> 16U);
            u32C_Size = (((au32Buffer[1] & 0x000003ffU) << 2U) |
                         ((au32Buffer[2] & 0xc0000000U) >> 30U));
            u32MULT = ((au32Buffer[2] & 0x00038000U) >> 15U);
            u32Size = (u32C_Size + 1U) * (1U << (u32MULT + 2U)) * (1U << u32R_LEN);

            pSD->diskSize = u32Size / 1024U;
            pSD->totalSectorN = u32Size / 512U;
        }
    }

    pSD->sectorSize = (int)512;
}

static uint32_t SDH_ResetCard(SDH_T *sdh)
{
    SDH_INFO_T *pSD;
    uint32_t i32TimeOutCount;

    sdh->GINTEN = 0U;
    sdh->CTL &= ~SDH_CTL_SDNWR_Msk;
    sdh->CTL |= ((uint32_t)0x09U << SDH_CTL_SDNWR_Pos);    /* set SDNWR = 9 */
    sdh->CTL &= ~SDH_CTL_BLKCNT_Msk;
    sdh->CTL |= ((uint32_t)0x01U << SDH_CTL_BLKCNT_Pos);   /* set BLKCNT = 1 */
    sdh->CTL &= ~SDH_CTL_DBW_Msk;               /* SD 1-bit data bus */

    if (sdh == SDH0)
    {
        pSD = &SD0;
    }
    else
    {
        pSD = &SD1;
    }

    pSD->i32ErrCode = 0;

    /* set the clock to 300KHz */
    SDH_Set_clock(sdh, 300U);

    /* power ON 74 clock */
    sdh->CTL |= SDH_CTL_CLK74OEN_Msk;

    i32TimeOutCount = (int32_t)SDH_TIMEOUT_CNT;

    while ((sdh->CTL & SDH_CTL_CLK74OEN_Msk) == SDH_CTL_CLK74OEN_Msk)
    {
        if (--i32TimeOutCount == 0)
        {
            pSD->i32ErrCode = SDH_ERR_TIMEOUT;
            return SDH_ERR_TIMEOUT;
        }
    }

    return SDH_SDCommand(sdh, 0U, 0U);
}

/** @endcond HIDDEN_SYMBOLS */

/**
 *  @brief  This function use to reset SD function and select card detection source and pin.
 *
 *  @param[in]  sdh Select SDH0 or SDH1.
 *  @param[in]  u32CardDetSrc Select card detection pin from GPIO or DAT3 pin.
 *                          - \ref CardDetect_From_GPIO
 *                          - \ref CardDetect_From_DAT3
 *
 *  @return None
 */
void SDH_Open(SDH_T *sdh, uint32_t u32CardDetSrc)
{
    int32_t i32TimeOutCount;
    volatile int u32i;
    SDH_INFO_T *pSD;

    if (sdh == (SDH_T *)NULL)
    {
        return;
    }

    if (sdh == SDH0)
    {
        pSD = &SD0;
    }
    else
    {
        pSD = &SD1;
    }

    pSD->i32ErrCode = 0;

    sdh->DMACTL = SDH_DMACTL_DMARST_Msk;
    i32TimeOutCount = (int32_t)SDH_TIMEOUT_CNT;

    while ((sdh->DMACTL & SDH_DMACTL_DMARST_Msk) == SDH_DMACTL_DMARST_Msk)
    {
        if (--i32TimeOutCount <= 0)
        {
            pSD->i32ErrCode = SDH_ERR_TIMEOUT;
            break;
        }
    }

    sdh->DMACTL = SDH_DMACTL_DMAEN_Msk;

    sdh->GCTL = SDH_GCTL_GCTLRST_Msk | SDH_GCTL_SDEN_Msk;
    i32TimeOutCount = (int32_t)SDH_TIMEOUT_CNT;

    while ((sdh->GCTL & SDH_GCTL_GCTLRST_Msk) == SDH_GCTL_GCTLRST_Msk)
    {
        if (--i32TimeOutCount <= 0)
        {
            pSD->i32ErrCode = SDH_ERR_TIMEOUT;
            break;
        }
    }

    if (sdh == SDH0)
    {
        NVIC_EnableIRQ(SDH0_IRQn);
        (void)memset(&SD0, 0, sizeof(SDH_INFO_T));
        SD0.dmabuf = _SDH0_ucSDHCBuffer;
    }
    else if (sdh == SDH1)
    {
        NVIC_EnableIRQ(SDH1_IRQn);
        (void)memset(&SD1, 0, sizeof(SDH_INFO_T));
        SD1.dmabuf = _SDH1_ucSDHCBuffer;
    }
    else
    {
    }

    sdh->GCTL = SDH_GCTL_SDEN_Msk;

    if ((u32CardDetSrc & CardDetect_From_DAT3) == CardDetect_From_DAT3)
    {
        sdh->INTEN &= ~SDH_INTEN_CDSRC_Msk;
    }
    else
    {
        sdh->INTEN |= SDH_INTEN_CDSRC_Msk;
    }

    for (u32i = 0; u32i < 0x100; u32i++) {}

    sdh->INTSTS = SDH_INTSTS_CDIF_Msk;

    if ((u32CardDetSrc & CardDetect_From_DAT3) == CardDetect_From_DAT3)
    {
        /* Use polling mode. */
        sdh->INTEN &= ~SDH_INTEN_CDIEN_Msk;
    }
    else
    {
        sdh->INTEN |= SDH_INTEN_CDIEN_Msk;
    }

    sdh->CTL |= SDH_CTL_CTLRST_Msk;
    i32TimeOutCount = (int32_t)SDH_TIMEOUT_CNT;

    while ((sdh->CTL & SDH_CTL_CTLRST_Msk) == SDH_CTL_CTLRST_Msk)
    {
        if (--i32TimeOutCount <= 0)
        {
            pSD->i32ErrCode = SDH_ERR_TIMEOUT;
            break;
        }
    }

    if ((u32CardDetSrc & CardDetect_From_DAT3) == CardDetect_From_DAT3)
    {
        /* Forcefully reset the SD card state to idle to prevent DAT3 voltage in an unexpected level due to transmission terminated. */
        (void)SDH_ResetCard(sdh);
    }
}

void SDH_Close(SDH_T *sdh)
{

    if (sdh == (SDH_T *)NULL)
    {
        return;
    }

    sdh->GCTL &= ~(SDH_GCTL_GCTLRST_Msk | SDH_GCTL_SDEN_Msk);

    if (sdh == SDH0)
    {
        NVIC_DisableIRQ(SDH0_IRQn);
    }
    else if (sdh == SDH1)
    {
        NVIC_DisableIRQ(SDH1_IRQn);
    }
    else
    {
    }
}

/**
 *  @brief  This function use to initial SD card.
 *
 *  @param[in]    sdh    Select SDH0 or SDH1.
 *
 *  @return None
 *
 *  @details This function is used to initial SD card.
 *           SD initial state needs 400KHz clock output, driver will use HIRC for SD initial clock source.
 *           And then switch back to the user's setting.
 */
uint32_t SDH_Probe(SDH_T *sdh)
{
    uint32_t u32Val;
    const SDH_INFO_T *pSD;

    pSD = SDH_GetSDInfoMsg(sdh);

    if (pSD == (SDH_INFO_T *)NULL)
    {
        return SDH_SELECT_ERROR;
    }

    sdh->GINTEN = 0U;
    sdh->CTL &= ~SDH_CTL_SDNWR_Msk;
    sdh->CTL |= ((uint32_t)0x09U << SDH_CTL_SDNWR_Pos);    /* set SDNWR = 9 */
    sdh->CTL &= ~SDH_CTL_BLKCNT_Msk;
    sdh->CTL |= ((uint32_t)0x01U << SDH_CTL_BLKCNT_Pos);   /* set BLKCNT = 1 */
    sdh->CTL &= ~SDH_CTL_DBW_Msk;               /* SD 1-bit data bus */

    if (!(SDH_CardDetection(sdh)))
    {
        return SDH_NO_SD_CARD;
    }

    u32Val = SDH_Init(sdh);

