OpenNuvoton/M55M1BSP/Library/StdDriver/src/sdh.c
    if (u32Val != 0U)
    {
        return u32Val;
    }

    /* divider */
    if (pSD->CardType == SDH_TYPE_MMC)
    {
        SDH_Set_clock(sdh, MMC_FREQ);
    }
    else
    {
        SDH_Set_clock(sdh, SD_FREQ);
    }

    SDH_Get_SD_info(sdh);

    u32Val = SDH_SelectCardType(sdh);

    if (u32Val != 0U)
    {
        return u32Val;
    }

    return 0U;
}

static uint32_t _SDH_Read(SDH_T *sdh, const uint8_t *pu8BufAddr, uint32_t u32StartSec, uint32_t u32SecCount)
{
    uint32_t volatile u32BIsSendCmd = FALSE;
    uint32_t volatile u32Reg;
    uint32_t volatile i;
    uint32_t volatile u32Loop;
    uint32_t volatile u32Status;
    uint32_t blksize = SDH_BLOCK_SIZE;
    int32_t i32TimeOutCount;

    SDH_INFO_T *pSD;

    if (pu8BufAddr == (uint8_t *)NULL)
    {
        return Fail;
    }

    pSD = SDH_GetSDInfoMsg(sdh);

    if (pSD == (SDH_INFO_T *)NULL)
    {
        return SDH_SELECT_ERROR;
    }

    pSD->i32ErrCode = 0;

    if (u32SecCount == 0U)
    {
        return SDH_SELECT_ERROR;
    }

    u32Status = SDH_SDCmdAndRsp(sdh, 7U, pSD->RCA, 0U);

    if (u32Status  != Successful)
    {
        return u32Status;
    }

    u32Status = SDH_CheckRB(sdh);

    if (u32Status != Successful)
    {
        return SDH_ERR_TIMEOUT;
    }

    sdh->BLEN = blksize - 1U;       /* the actual byte count is equal to (SDBLEN+1) */

    if ((pSD->CardType == SDH_TYPE_SD_HIGH) || (pSD->CardType == SDH_TYPE_EMMC))
    {
        sdh->CMDARG = u32StartSec;
    }
    else
    {
        sdh->CMDARG = u32StartSec * blksize;
    }

    sdh->DMASA = SDH_GetDMAAddress(pu8BufAddr);

    u32Loop = u32SecCount / 255U;

    for (i = 0U; i < u32Loop; i++)
    {
        pSD->DataReadyFlag = (uint8_t)FALSE;
        u32Reg = sdh->CTL & ~SDH_CTL_CMDCODE_Msk;
        u32Reg = u32Reg | 0xff0000U;   /* set BLK_CNT to 255 */

        if (u32BIsSendCmd == FALSE)
        {
            sdh->CTL = (u32Reg |
                        ((uint32_t)18U << 8U) |
                        (SDH_CTL_COEN_Msk |
                         SDH_CTL_RIEN_Msk |
                         SDH_CTL_DIEN_Msk));
            u32BIsSendCmd = TRUE;
        }
        else
        {
            sdh->CTL = u32Reg | SDH_CTL_DIEN_Msk;
        }

        i32TimeOutCount = (int32_t)SDH_TIMEOUT_CNT;

        while (!pSD->DataReadyFlag)
        {
            SDH_UpdateDataReadyFlag(sdh, pSD);

            if (pSD->IsCardInsert == FALSE)
            {
                return SDH_NO_SD_CARD;
            }

            if (--i32TimeOutCount <= 0)
            {
                pSD->i32ErrCode = SDH_ERR_TIMEOUT;
                break;
            }
        }

        if (pSD->i32ErrCode != 0)
        {
            return SDH_ERR_TIMEOUT;
        }

        if ((sdh->INTSTS & SDH_INTSTS_CRC7_Msk) != SDH_INTSTS_CRC7_Msk)      /* check CRC7 */
        {
            return SDH_CRC7_ERROR;
        }

        if ((sdh->INTSTS & SDH_INTSTS_CRC16_Msk) != SDH_INTSTS_CRC16_Msk)     /* check CRC16 */
        {
            return SDH_CRC16_ERROR;
        }
    }

    u32Loop = u32SecCount % 255U;

    if (u32Loop != 0U)
    {
        pSD->DataReadyFlag = (uint8_t)FALSE;
        u32Reg = sdh->CTL & (~SDH_CTL_CMDCODE_Msk);
        u32Reg = u32Reg & (~SDH_CTL_BLKCNT_Msk);
        u32Reg |= (u32Loop << 16);    /* setup SDCR_BLKCNT */

        if (u32BIsSendCmd == FALSE)
        {
            sdh->CTL = (u32Reg |
                        ((uint32_t)18U << 8) |
                        (SDH_CTL_COEN_Msk |
                         SDH_CTL_RIEN_Msk |
                         SDH_CTL_DIEN_Msk));
            u32BIsSendCmd = TRUE;
        }
        else
        {
            sdh->CTL = u32Reg | SDH_CTL_DIEN_Msk;
        }

        i32TimeOutCount = (int32_t)SDH_TIMEOUT_CNT;

        while (!pSD->DataReadyFlag)
        {
            SDH_UpdateDataReadyFlag(sdh, pSD);

            if (pSD->IsCardInsert == FALSE)
            {
                return SDH_NO_SD_CARD;
            }

            if (--i32TimeOutCount <= 0)
            {
                pSD->i32ErrCode = SDH_ERR_TIMEOUT;
                break;
            }
        }

        if (pSD->i32ErrCode != 0)
        {
            return SDH_ERR_TIMEOUT;
        }

        if ((sdh->INTSTS & SDH_INTSTS_CRC7_Msk) != SDH_INTSTS_CRC7_Msk)      /* check CRC7 */
        {
            return SDH_CRC7_ERROR;
        }

        if ((sdh->INTSTS & SDH_INTSTS_CRC16_Msk) != SDH_INTSTS_CRC16_Msk)     /* check CRC16 */
        {
            return SDH_CRC16_ERROR;
        }
    }

    if (SDH_SDCmdAndRsp(sdh, 12U, 0U, 0U))      /* stop command */
    {
        return SDH_CRC7_ERROR;
    }

    u32Status = SDH_CheckRB(sdh);

    if (u32Status != Successful)
    {
        return SDH_ERR_TIMEOUT;
    }

    (void)SDH_SDCommand(sdh, 7U, 0U);
    sdh->CTL |= SDH_CTL_CLK8OEN_Msk;
    i32TimeOutCount = (int32_t)SDH_TIMEOUT_CNT;

    while ((sdh->CTL & SDH_CTL_CLK8OEN_Msk) == SDH_CTL_CLK8OEN_Msk)
    {
        if (--i32TimeOutCount <= 0)
        {
            pSD->i32ErrCode = SDH_ERR_TIMEOUT;
            break;
        }
    }

    if (pSD->i32ErrCode != 0)
    {
        return Fail;
    }

    return Successful;
}

/**
 *  @brief  This function use to read data from SD card.
 *
 *  @param[in]     sdh           Select SDH0 or SDH1.
 *  @param[out]    pu8BufAddr    The buffer to receive the data from SD card.
 *  @param[in]     u32StartSec   The start read sector address.
 *  @param[in]     u32SecCount   The the read sector number of data
 *
 *  @return   \ref SDH_SELECT_ERROR : u32SecCount is zero.
 *            \ref SDH_NO_SD_CARD : SD card be removed.
 *            \ref SDH_CRC_ERROR : CRC error happen.
 *            \ref SDH_CRC7_ERROR : CRC7 error happen.
 *            \ref Successful : Read data from SD card success.
 */
uint32_t SDH_Read(SDH_T *sdh, uint8_t *pu8BufAddr, uint32_t u32StartSec, uint32_t u32SecCount)
{
    uint32_t u32DrvRet;

    if (pu8BufAddr == (uint8_t *)NULL)
    {
        return Fail;
    }

    if (u32SecCount == 0U)
    {
        return SDH_SELECT_ERROR;
    }

    u32DrvRet = SDH_EnsureCardReady(sdh);

    if (u32DrvRet != Successful)
    {
        return u32DrvRet;
    }

    /* Check for alignment to word or cache line boundaries. */
    if (((uintptr_t)pu8BufAddr % (uintptr_t)DEF_ALIGNED_VALUE) != 0UL)
    {
        const uint8_t *pu8NCBuffer;
        uint32_t u32i = 0;

        if (sdh == SDH0)
        {
            pu8NCBuffer = _SDH0_ucSDHCBuffer;
        }
        else if (sdh == SDH1)
        {
            pu8NCBuffer = _SDH1_ucSDHCBuffer;
        }
        else
        {
            return Fail;
        }

        while (u32i < u32SecCount)
        {
            /* Read data from SD card to the temporary buffer buffer. */
            u32DrvRet = _SDH_Read(sdh, pu8NCBuffer, u32StartSec + u32i, 1);

            if (u32DrvRet != Successful)
            {
                return u32DrvRet;
            }

            /* Copy temporary buffer to user-data buffer after reading. */
            (void)memcpy(&pu8BufAddr[(u32i * SDH_BLOCK_SIZE)], pu8NCBuffer, SDH_BLOCK_SIZE);

            u32i++;
        }
    }
    else
    {
        /* Read data from SD card to the destination buffer. */
        u32DrvRet = _SDH_Read(sdh, pu8BufAddr, u32StartSec, u32SecCount);

        if (u32DrvRet != Successful)
        {
            return u32DrvRet;
        }

#if (NVT_DCACHE_ON == 1)
        SDH_InvalidateDCacheBuffer((void *)pu8BufAddr, u32SecCount * SDH_BLOCK_SIZE);
#endif
    }

    return Successful;
}

static uint32_t _SDH_Write(SDH_T *sdh, const uint8_t *pu8BufAddr, uint32_t u32StartSec, uint32_t u32SecCount)
{
    uint32_t volatile u32BIsSendCmd = FALSE;
    uint32_t volatile u32Reg;
    uint32_t volatile u32i;
    uint32_t volatile u32Loop;
    uint32_t volatile u32Status;
    int32_t i32TimeOutCount;

    SDH_INFO_T *pSD;

