OpenNuvoton/M55M1BSP/Library/StdDriver/src/sdh.c
    if (pu8BufAddr == (uint8_t *)NULL)
    {
        return Fail;
    }

    pSD = SDH_GetSDInfoMsg(sdh);

    if (pSD == (SDH_INFO_T *)NULL)
    {
        return SDH_SELECT_ERROR;
    }

    pSD->i32ErrCode = 0;

    if (u32SecCount == 0U)
    {
        return SDH_SELECT_ERROR;
    }

    u32Status = SDH_SDCmdAndRsp(sdh, 7U, pSD->RCA, 0U);

    if (u32Status != Successful)
    {
        return u32Status;
    }

    u32Status = SDH_CheckRB(sdh);

    if (u32Status != Successful)
    {
        return SDH_ERR_TIMEOUT;
    }

    /* According to SD Spec v2.0, the write CMD block size MUST be 512, and the start address MUST be 512*n. */
    sdh->BLEN = SDH_BLOCK_SIZE - 1U;

    if ((pSD->CardType == SDH_TYPE_SD_HIGH) || (pSD->CardType == SDH_TYPE_EMMC))
    {
        sdh->CMDARG = u32StartSec;
    }
    else
    {
        sdh->CMDARG = u32StartSec * SDH_BLOCK_SIZE;  /* set start address for SD CMD */
    }

    sdh->DMASA = SDH_GetDMAAddress(pu8BufAddr);
    u32Loop = u32SecCount / 255U;   /* the maximum block count is 0xFF=255 for register SDCR[BLK_CNT] */

    for (u32i = 0U; u32i < u32Loop; u32i++)
    {
        pSD->DataReadyFlag = (uint8_t)FALSE;
        u32Reg = (sdh->CTL & SDH_CTL_WRITE_KEEP_MASK) | SDH_CTL_BLKCNT_Msk;   /* set BLK_CNT to 0xFF=255 */

        if (!u32BIsSendCmd)
        {
            sdh->CTL = (u32Reg |
                        ((uint32_t)25U << SDH_CTL_CMDCODE_Pos) |
                        (SDH_CTL_COEN_Msk |
                         SDH_CTL_RIEN_Msk |
                         SDH_CTL_DOEN_Msk));
            u32BIsSendCmd = TRUE;
        }
        else
        {
            sdh->CTL = u32Reg | SDH_CTL_DOEN_Msk;
        }

        i32TimeOutCount = (int32_t)SDH_TIMEOUT_CNT;

        while (!pSD->DataReadyFlag)
        {
            SDH_UpdateDataReadyFlag(sdh, pSD);

            if (pSD->IsCardInsert == FALSE)
            {
                return SDH_NO_SD_CARD;
            }

            if (--i32TimeOutCount <= 0)
            {
                pSD->i32ErrCode = SDH_ERR_TIMEOUT;
                break;
            }
        }

        if (pSD->i32ErrCode != 0)
        {
            return SDH_ERR_TIMEOUT;
        }

        if ((sdh->INTSTS & SDH_INTSTS_CRCIF_Msk) != 0U)
        {
            sdh->INTSTS = SDH_INTSTS_CRCIF_Msk;
            return SDH_CRC_ERROR;
        }
    }

    u32Loop = u32SecCount % 255U;

    if (u32Loop != 0U)
    {
        pSD->DataReadyFlag = (uint8_t)FALSE;
        u32Reg = (sdh->CTL & SDH_CTL_WRITE_KEEP_MASK) | ((u32Loop << SDH_CTL_BLKCNT_Pos) & SDH_CTL_BLKCNT_Msk);

        if (!u32BIsSendCmd)
        {
            sdh->CTL = (u32Reg |
                        ((uint32_t)25U << SDH_CTL_CMDCODE_Pos) |
                        (SDH_CTL_COEN_Msk |
                         SDH_CTL_RIEN_Msk |
                         SDH_CTL_DOEN_Msk));
            u32BIsSendCmd = TRUE;
        }
        else
        {
            sdh->CTL = u32Reg | SDH_CTL_DOEN_Msk;
        }

        i32TimeOutCount = (int32_t)SDH_TIMEOUT_CNT;

        while (!pSD->DataReadyFlag)
        {
            SDH_UpdateDataReadyFlag(sdh, pSD);

            if (pSD->IsCardInsert == FALSE)
            {
                return SDH_NO_SD_CARD;
            }

            if (--i32TimeOutCount <= 0)
            {
                pSD->i32ErrCode = SDH_ERR_TIMEOUT;
                break;
            }
        }

        if (pSD->i32ErrCode != 0)
        {
            return SDH_ERR_TIMEOUT;
        }

        if ((sdh->INTSTS & SDH_INTSTS_CRCIF_Msk) != 0U)
        {
            sdh->INTSTS = SDH_INTSTS_CRCIF_Msk;
            return SDH_CRC_ERROR;
        }
    }

    sdh->INTSTS = SDH_INTSTS_CRCIF_Msk;

    if (SDH_SDCmdAndRsp(sdh, 12U, 0U, 0U))      /* stop command */
    {
        return SDH_CRC7_ERROR;
    }

    u32Status = SDH_CheckRB(sdh);

    if (u32Status != Successful)
    {
        return SDH_ERR_TIMEOUT;
    }

    (void)SDH_SDCommand(sdh, 7U, 0U);
    sdh->CTL |= SDH_CTL_CLK8OEN_Msk;
    i32TimeOutCount = (int32_t)SDH_TIMEOUT_CNT;

    while ((sdh->CTL & SDH_CTL_CLK8OEN_Msk) == SDH_CTL_CLK8OEN_Msk)
    {
        if (--i32TimeOutCount <= 0)
        {
            pSD->i32ErrCode = SDH_ERR_TIMEOUT;
            break;
        }
    }

    if (pSD->i32ErrCode != 0)
    {
        return Fail;
    }

    return Successful;
}

/**
 *  @brief  This function use to write data to SD card.
 *
 *  @param[in]    sdh           Select SDH0 or SDH1.
 *  @param[in]    pu8BufAddr    The buffer to send the data to SD card.
 *  @param[in]    u32StartSec   The start write sector address.
 *  @param[in]    u32SecCount   The the write sector number of data.
 *
 *  @return   \ref SDH_SELECT_ERROR : u32SecCount is zero.
 *            \ref SDH_NO_SD_CARD : SD card be removed.
 *            \ref SDH_CRC_ERROR : CRC error happen.
 *            \ref SDH_CRC7_ERROR : CRC7 error happen.
 *            \ref Successful : Write data to SD card success.
 */
uint32_t SDH_Write(SDH_T *sdh, uint8_t *pu8BufAddr, uint32_t u32StartSec, uint32_t u32SecCount)
{
    uint32_t u32DrvRet;

    if (pu8BufAddr == (uint8_t *)NULL)
    {
        return Fail;
    }

    if (u32SecCount == 0U)
    {
        return SDH_SELECT_ERROR;
    }

    u32DrvRet = SDH_EnsureCardReady(sdh);

    if (u32DrvRet != Successful)
    {
        return u32DrvRet;
    }

    /* Check for alignment to word or cache line boundaries. */
    if (((uintptr_t)pu8BufAddr % (uintptr_t)DEF_ALIGNED_VALUE) != 0UL)
    {
        uint32_t u32i = 0;
        uint8_t *puNCBuffer;

        if (sdh == SDH0)
        {
            puNCBuffer = _SDH0_ucSDHCBuffer;
        }
        else if (sdh == SDH1)
        {
            puNCBuffer = _SDH1_ucSDHCBuffer;
        }
        else
        {
            return Fail;
        }

        while (u32i < u32SecCount)
        {
            /* Copy user data to the temporary buffer to prepare for writing to the SD card. */
            (void)memcpy(puNCBuffer, &pu8BufAddr[(u32i * SDH_BLOCK_SIZE)], SDH_BLOCK_SIZE);

            /* Flush the data cache for the temporary buffer before writing to the SD card.
             * This ensures that all cached data is written to memory before the write operation. */
            u32DrvRet = _SDH_Write(sdh, puNCBuffer, u32StartSec + u32i, 1);

            if (u32DrvRet != Successful)
            {
                return u32DrvRet;
            }

            u32i++;
        }
    }
    else
    {
#if (NVT_DCACHE_ON == 1)
        SDH_CleanDCacheBuffer((void *)pu8BufAddr, u32SecCount * SDH_BLOCK_SIZE);
#endif

        /* Write data from the destination buffer to specific sector address. */
        u32DrvRet = _SDH_Write(sdh, pu8BufAddr, u32StartSec, u32SecCount);

        if (u32DrvRet != Successful)
        {
            return u32DrvRet;
        }
    }

    return Successful;
}

//int32_t SDH_Open_Disk(SDH_T *sdh, uint32_t u32CardDetSrc)
//{
//    SDH_Open(sdh, u32CardDetSrc);

//    return (int32_t)SDH_Probe(sdh);
//}

//void SDH_Close_Disk(SDH_T *sdh)
//{
//    SDH_Close(sdh);
//}

/** @} end of group SDH_EXPORTED_FUNCTIONS */
/** @} end of group SDH_Driver */
/** @} end of group Standard_Driver */
